public class Main {
    //+1. Создать окно для клиентской части чата: большое текстовое поле для отображения переписки в центре окна.

    //+2. Однострочное текстовое поле для ввода сообщений и кнопка для отсылки сообщений на нижней панели.
    // Сообщение должно отсылаться либо по нажатию кнопки на форме, либо по нажатию кнопки Enter.
    // При «отсылке» сообщение перекидывается из нижнего поля в центральное.

    //+3. ** Создать MenuBar (Меню, О программе). В меню есть кнопка Выход, по нажатию который приложение выключается.

    public static void main(String[] args) {
        new ChatWindow();
    }
}
